{
  "career": [
    {
      "name": "ED",
      "href": "https://ed.dev.br/",
      "title": "FullStack Junior Developer",
      "logo": "/ed.png",
      "start": "Jul 2024",
      "description": [
        "Created and maintained AI, back-end, and front-end projects, integrating an OpenAI-powered chatbot into Teams using N8N and Nocobase connected to the API.",
        "Contributed to the back-end, delivering multiple features using Java 17 and Spring Boot 3 in a microservices architecture.",
        "Refactored front-end components, updating outdated elements to the latest version of React 18."
      ],
      "stack": [
        "Java",
        "React.js",
        ".NET",
        "N8N",
        "Docker",
        "OpenAI"
      ]
    },
    {
      "name": "Ipnet Growth Partner",
      "href": "https://www.ipnet.cloud/",
      "title": "Data Science",
      "logo": "/ipnet.png",
      "start": "Dez 2023",
      "end": "Jul 2024",
      "description": [
        "Developed a document similarity system using Python, vector databases, and embeddings, optimizing search, creation, and analysis processes, addressing a critical issue faced by the company for two years.",
        "Actively participated in deploying the application on Google Cloud Platform (GCP), using Virtual Machines and Google Cloud SQL.",
        "Translated simulation proofs for certifications like Google Cloud Digital Leader, Google Professional Cloud Architect, and Google Associate Cloud Engineer using the Vertex AI textTranslate API."
      ],
      "stack": [
        "GCP",
        "Python",
        "AI",
        "Vertex AI",
        "Docker"
      ]
    },
    {
      "name": "Iuul",
      "href": "https://iuul.com.br/",
      "title": "Software Developer",
      "logo": "/iuul.png",
      "start": "Jun 2023",
      "end": "Apr 2024",
      "description": [
        "Developed a system to monitor data, including price comparisons and stock analysis for specific products across multiple stores.",
        "Actively contributed to all stages of the project, from application architecture to deployment.",
        "Improved security and performance through testing and code refactoring, enhancing both the client and developer experience."
      ],
      "stack": [
        "Node.js",
        "Express",
        "Sequelize",
        "Azure",
        "AWS",
        "Puppeteer"
      ]
    },
    {
      "name": "Internit",
      "href": "https://www.activate.sg",
      "title": "Software Developer (Intern)",
      "logo": "/internit.png",
      "start": "Set 2022",
      "end": "Dez 2023",
      "description": [
        "Worked on delivering new features and maintaining systems using various technologies such as PHP, Node.js, WordPress, and Next.js.",
        "Participated in international-level projects, contributing to the growth and success of the team.",
        "Played a key role in implementing new technologies, including migrating WordPress to Next.js, which improved delivery efficiency, team development, and customer satisfaction."
      ],
      "stack": [
        "PHP",
        "WordPress",
        "Reactjs",
        "Nextjs",
        "Vercel"
      ]
    }
  ]
}